taurus_container_scripts/DGT-JMETER.yaml

# Script generated by Blazemeter Chrome Extension

execution:
  - scenario: digital toys
    concurrency: 20
    ramp-up: 1m
    hold-for: 19m
scenarios:
  digital toys:
    headers:
      Upgrade-Insecure-Requests: '1'
      User-Agent: 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_2) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/79.0.3945.117 Safari/537.36'
      Sec-Fetch-User: '?1'
      Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.9'
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: 'http://localhost/'
            method: GET
            label: 'http://localhost/'
            think-time: 0ms
            headers: {}
          - url: 'http://localhost/user/signUp'
            method: GET
            label: 'http://localhost/user/signUp'
            think-time: 27734ms
            headers: {}
          - url: 'http://localhost/user/signUp'
            method: POST
            label: 'http://localhost/user/signUp'
            think-time: 11108ms
            headers:
              Origin: 'http://localhost'
              Content-Type: application/x-www-form-urlencoded
            body:
              email: Test@gmail.com
              fullName: Test
              password: Test
          - url: 'http://localhost/'
            method: GET
            label: 'http://localhost/'
            think-time: 71ms
            headers:
              Origin: 'http://localhost'
              Content-Type: application/x-www-form-urlencoded
          - url: 'http://localhost/product/detail'
            method: GET
            label: 'http://localhost/product/detail'
            think-time: 6005ms
            headers: {}
            body:
              productId: '1'
          - url: 'http://localhost/order/addToCart'
            method: POST
            label: 'http://localhost/order/addToCart'
            think-time: 1834ms
            headers:
              Origin: 'http://localhost'
              Content-Type: application/x-www-form-urlencoded
            body:
              productId: '1'
          - url: 'http://localhost/'
            method: GET
            label: 'http://localhost/'
            think-time: 1946ms
            headers: {}
          - url: 'http://localhost/product/detail'
            method: GET
            label: 'http://localhost/product/detail'
            think-time: 1885ms
            headers: {}
            body:
              productId: '2'
          - url: 'http://localhost/order/addToCart'
            method: POST
            label: 'http://localhost/order/addToCart'
            think-time: 1356ms
            headers:
              Origin: 'http://localhost'
              Content-Type: application/x-www-form-urlencoded
            body:
              productId: '2'
          - url: 'http://localhost/'
            method: GET
            label: 'http://localhost/'
            think-time: 2113ms
            headers: {}
          - url: 'http://localhost/product/detail'
            method: GET
            label: 'http://localhost/product/detail'
            think-time: 1364ms
            headers: {}
            body:
              productId: '3'
          - url: 'http://localhost/order/addToCart'
            method: POST
            label: 'http://localhost/order/addToCart'
            think-time: 1325ms
            headers:
              Origin: 'http://localhost'
              Content-Type: application/x-www-form-urlencoded
            body:
              productId: '3'
          - url: 'http://localhost/'
            method: GET
            label: 'http://localhost/'
            think-time: 1354ms
            headers: {}
          - url: 'http://localhost/order/addToCart'
            method: GET
            label: 'http://localhost/order/addToCart'
            think-time: 3971ms
            headers: {}
          - url: 'http://localhost/order/checkOut'
            method: GET
            label: 'http://localhost/order/checkOut'
            think-time: 2190ms
            headers: {}
          - url: 'http://localhost/user/addAddress'
            method: POST
            label: 'http://localhost/user/addAddress'
            think-time: 10707ms
            headers:
              Origin: 'http://localhost'
              Content-Type: application/x-www-form-urlencoded
            body:
              addressId: ''
              checkOutFlow: 'true'
              city: test
              line1: test
              line2: test
              state: AL
              zip: '12345'
          - url: 'http://localhost/order/checkOut'
            method: GET
            label: 'http://localhost/order/checkOut'
            think-time: 58ms
            headers:
              Origin: 'http://localhost'
              Content-Type: application/x-www-form-urlencoded
          - url: 'http://localhost/user/addCard'
            method: POST
            label: 'http://localhost/user/addCard'
            think-time: 9725ms
            headers:
              Origin: 'http://localhost'
              Content-Type: application/x-www-form-urlencoded
            body:
              cardId: ''
              cardNumber: '123456780'
              checkOutFlow: 'true'
              expirationMonthYear: 01/2020
              nameOnCard: Test
          - url: 'http://localhost/order/checkOut'
            method: GET
            label: 'http://localhost/order/checkOut'
            think-time: 43ms
            headers:
              Origin: 'http://localhost'
              Content-Type: application/x-www-form-urlencoded
          - url: 'http://localhost/order/placeOrder'
            method: GET
            label: 'http://localhost/order/placeOrder'
            think-time: 3791ms
            headers: {}
          - url: 'http://localhost/user/signOut'
            method: GET
            label: 'http://localhost/user/signOut'
            think-time: 5136ms
            headers: {}